Autodesk.Navisworks.Api.Data.DatabaseChange
The element of  DatabaseChangeCollection.

Autodesk.Navisworks.Api.Data.DatabaseChange.ChangedType
The type of change DatabaseChangeTypes.

Autodesk.Navisworks.Api.Data.DatabaseChange.RowId
The row id of current database change, use the RowId to find out all columns.

Autodesk.Navisworks.Api.Data.DatabaseChange.TableName
The table name of current database change.